Revit 2024 API
Application.IsSystemsEnabled Property
 Checks whether or not any systems disciplines (mechanical, electrical, or piping) are enabled.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsSystemsEnabled { get; }
Visual Basic
Public ReadOnly Property IsSystemsEnabled As Boolean
	Get
Visual C++
public:
property bool IsSystemsEnabled {
	bool get ();
}
See Also
Application Class
Autodesk.Revit.ApplicationServices Namespace